import sys

from addons import salary

"""
1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника. В расчете
необходимо использовать формулу: (выработка в часах*ставка в час) + премия. Для выполнения расчета для конкретных
значений необходимо запускать скрипт с параметрами.
"""
_, total, bonus = sys.argv
print(f"Ваша зарплата составит: {salary(total, bonus)}")
